Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/udir.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: It also means being able to present one's own work clearly and comprehensibly to others, and being able to discuss one's own presentations as well as those of others.
nn: Det inneber å kunne presentere resultat av eige arbeid tydeleg og forståeleg for andre, og å kunne samtale om sine eigne og andre sine presentasjonar.

source: The teacher and pupils shall engage in dialogue with the pupils about their development in programming and strategies to solve problems.
nn: Læraren skal vere i dialog med elevane om utviklinga deira i programmering og strategiar for å løyse problem.

source: in geography means exploring and using texts and other sources and reflecting upon them.
nn: i geografi inneber å utforske og bruke tekstar og andre kjelder og reflektere over dei.

source: teachers in all subjects must support the pupils in their work with the basic skills.
nn: alle fag skal støtte elevane i arbeidet med grunnleggjande ferdigheiter.

source: Teachers need to be present both physically and mentally.
nn: Pedagogane skal vere til stades med både kropp og hovud.

source: Developing knowledge about how laws and rules regulate the legal relationship between individuals, between individuals and society and between states is central in the discipline.
nn: Å utvikle kompetanse om korleis lover og reglar regulerer rettstilhøva mellom individ, mellom individ og samfunn og mellom statar, er sentralt i faget.

source: It shall also provide insight into the international legal system.
nn: Det skal òg gje innsikt i det internasjonale rettssystemet.

source: The pupils shall have the opportunity to explore and experiment.
nn: Elevane skal få moglegheit til å utforske og prøve seg fram.

source: give an account of the concepts of attitude, prejudice and racism and evaluate how attitudes can be influenced and how the individual and society can counteract prejudice and racism
nn: gjere greie for omgrepa haldningar, fordommar og rasisme og vurdere korleis haldningar kan bli påverka, og korleis den einskilde og samfunnet kan motarbeide fordommar og rasisme

source: consideration of the entire group, between supporting and demanding, between the work in
nn: enkelte eleven og omsynet til fellesskapen, mellom å støtte og stille krav, mellom

source: In the private kindergarten, the staff members could choose the method they wanted to use in their evaluation work.
nn: I den private barnehagen kunne dei tilsette sjølve velje kva for metodar dei ville bruke i vurderingsarbeidet.

source: Helena Ackesjö has written her PhD thesis on the transition from kindergarten and preschool class to school.
nn: Helena Ackesjö har i si doktoravhandling undesøkt overgangen frå barnehage og førskole til skole.

source: The teacher and pupils shall engage in dialogue about their development in programming and geometry.
nn: Læraren skal vere i dialog med elevane om utviklinga deira i programmering og geometri.

source: An exclusion occurs that was unintentional.
nn: Der skjer ein eksklusjon som er utilsikta.

source: Dynamic processes are studied, such as mirroring, rotation and displacement.
nn: Ein studerer dynamiske prosessar, som spegling, rotasjon og forskyving.

source: The social studies subject shall help pupils to understand the value of technology and entrepreneurship.
nn: Samfunnsfaget skal gjere det lettare for elevane å forstå verdien av teknologi og entreprenørskap.

source: apply the principal rules relating to possession, duty to provide maintenance and liability for debt in marriage, registered partnership and non-marital cohabitation
nn: bruke hovudreglane om råderett, underhaldsplikt og ansvar for gjeld i ekteskap, registrert partnarskap og sambuarskap

source: This means being able to collect, compare and systematise information from recipes, user guides, goods labelling, advertising, information material and other factual texts, and critically assessing them according to the aims of the subject.
nn: Det handlar om å kunne samle, samanlikne og systematisere informasjon frå oppskrifter, bruksrettleiingar, varemerking, reklame, informasjonsmateriell og andre sakprosatekstar, og vurdere dette kritisk ut frå føremålet med faget.

source: Geography has competence aims after Vg2 in the programme area for arts, crafts and design studies in programmes for specialisation in general studies /education programmes for music, dance, drama and sports
nn: Geografi har kompetansemål etter Vg2 i programområde for formgivingsfag i studiespesialiserande utdanningsprogram/ utdanningsprogram for musikk, dans, drama og idrettsfag

source: At the end they had 20 hours of video documentation.
nn: Til slutt sat dei igjen med 20 timar video.

source: When children and young people are treated with
nn: Når barn og unge møter respekt

source: explore the commutative and associative properties of addition and
nn: utforske den kommutative og den assosiative eigenskapen ved

source: To describe means to portray or recount an experience, situation, work process or a topic.
nn: Å beskrive er å skildre eller gi att ei oppleving, ein situasjon, ein arbeidsprosess eller eit fagleg emne.

source: individual's well-being, development and learning.
nn: skolen, bidrar fellesskapen til trivsel, utvikling og læring for den enkelte.

source: explore how communication and cultural encounters have influenced
nn: utforske korleis folk har arbeidd for myndiggjering og frigjering i norsk

source: on how identity, self-image and one’s own boundaries are developed and challenged in different environments, and
nn: over korleis identitet, sjølvbilete og eigne grenser blir utvikla og utfordra i ulike fellesskap, og

source: pupils acquire knowledge about and insight into nature and the environment, language and
nn: Danning skjer når elevane får kunnskap om og innsikt i natur og miljø, språk og historie,

source: Work in the subject shall stimulate discussions on the relation between production and consumption and evaluations of the consequences that resource use and living one's life have on the environment and sustainable development.
nn: Arbeid i faget skal stimulere til å drøfte samanhengar mellom produksjon og forbruk og vurdere konsekvensar som ressursbruk og livsutfalding har på miljøet og ei berekraftig utvikling.

source: The main subject area also includes basic knowledge about the body and personal hygiene.
nn: Hovudområdet omfattar òg grunnleggjande kunnskap om kroppen og personleg hygiene.

source: The main subject area Sports Activities covers a wide selection of sports, dance and alternative physical activities.
nn: Hovudområdet idrettsaktivitet omfattar eit breitt utval av idrettar, dansar og alternative rørsleaktivitetar.

source: log, sort, present and read data in tables and diagrams, and justify the
nn: logge, sortere, presentere og lese data i tabellar og diagram og grunngi

source: present the main features of Sami culture today and reflect on what it means to be an indigenous person
nn: presentere hovudtrekk ved samisk kultur i dag og reflektere over kva det vil seie å vere urfolk

source: The analysis can also apply to a work process.
nn: Analysen kan òg gjelde ein arbeidsprosess.

source: It also includes calculating time sheets and expenses in connection with one’s own media productions.
nn: Det tyder òg å rekne ut tidsbruk og kostnader i samband med eigne medieproduksjonar.

source: converse about love and respect, variations of sexual orientation, married life and family, and discuss the consequences of a lack of respect for our differences
nn: samtale om kjærleik og respekt, variasjon i seksuell orientering og samliv og familie og diskutere konsekvensar av manglande respekt for ulikskap

source: “Quality is a complex and value-loaded term.
nn: PP-tenesta skal gjennomføre ei individuell vurdering.

source: The school's interdisciplinary topic health and life skills shall give the pupils competence
nn: Folkehelse og livsmeistring som tverrfagleg tema i skolen skal gi elevane kompetanse som

source: give an account of the different explanations for why the gap between poor and rich counties exists and discuss measures to reduce poverty around the world
nn: gjere greie for ulike forklaringar på kvifor det finst fattige og rike land, og diskutere tiltak for å redusere fattigdommen i verda

source: explain how the genetic composition in populations is changed by mutations, natural selection, genetic drift, gene flow, horizontal gene transfer and change in the number of chromosomes
nn: forklare korleis den genetiske samansetjinga i populasjonar blir endra gjennom mutasjonar, naturleg seleksjon, genetisk drift, genflyt, horisontal genoverføring og endring av kromosomtal

source: the purpose of this use of history
nn: fortida ved å formulere problemstillingar, finne,

source: on relationships between language, culture and identity
nn: over samanhengar mellom språk, kultur og identitet

source: provide examples of and discuss and elaborate on democracy as a form of government, elaborate on political influence and power distribution in Norway and use digital channels to exercise democracy
nn: gje døme på og drøfte demokrati som styreform, gjere greie for politisk innverknad og maktfordeling i Noreg og bruke digitale kanalar for utøving av demokrati

source: The use of legal method shall put the pupil in a better position to assess and resolve legal problems and conflicts.
nn: Bruk av juridisk metode skal setje eleven betre i stand til å vurdere og løyse juridiske problem og konfliktar.

source: for well-being and development, but in education as a whole, play provides opportunities for
nn: nødvendig for trivsel og utvikling, men òg i opplæringa som heilskap gir leik moglegheiter til

source: Curriculum for the elective subject of Production of Goods and Services (PVT1-01)
nn: Læreplan i valfaget produksjon av varer og tenester (PVT1-01)

source: describe how boys and girls spend money and discuss matters that influence consumption
nn: undersøkje pengebruken til jenter og gutar og samtale om forhold som påverkar forbruk

source: focuses on population theories, development of populations and migration on earth.
nn: handlar om befolkningsteoriar, folketalsutvikling og flytting på jorda.

source: Basic skills are integrated in the competence objectives where they contribute to the development of competence in the subject, while also being part of this competence.
nn: Grunnleggjande ferdigheiter er integrerte i kompetansemåla, der dei medverkar til å utvikle fagkompetansen og er ein del av han.

source: Interaction and working together are key elements of this concept.
nn: Samhandling og det å gjere kvarandre gode er sentrale element i omgrepet.

source: This programme subject shall help individuals to express their own opinions and participate actively in the democratic process.
nn: Programfaget skal medverke til at den einskilde skal kunne uttrykkje eigne meiningar og delta aktivt i demokratiske prosessar.

source: investigate and discuss the use and misuse of resources, consequences this might have for the environment and society, and conflicts this can create locally and globally
nn: undersøkje og diskutere bruk og misbruk av ressursar, konsekvensar det kan få for miljøet og samfunnet, og konfliktar det kan skape lokalt og globalt

source: in Mathematics for the natural sciences involves using digital tools for comprehensive computations and visualisation.
nn: i matematikk handlar om å bruke slike verktøy til spel, utforsking, visualisering og publisering.

source: That means a lot of learning.
nn: Det ligg det mykje læring i.

source: expectations and opinions about the school's goals and practice.
nn: med skolen og praksisen i skolen.

source: The latter is not hard to do.
nn: Det siste er ikkje så vanskeleg.

source: in geography means exploring websites, collecting relevant information and using network-based communication on geographical topics, exercising critical use of sources and netiquette and learning about personal privacy protection and copyrights.
nn: i geografi inneber å utforske nettstader, hente relevant informasjon og bruke nettbasert kommunikasjon om geografiske tema, vise kjeldekritikk og nettvett og orientere seg om personvern og opphavsrett.

source: natural resources and assess the significance of this for people and a sustainable societyLæreplan i historie – fellesfag i studieforberedende
nn: eller konfliktar og reflektere over om fredsslutningar har bidrege til å skape fred og forsoningLæreplan i historie – fellesfag i studieforberedende

source: identify linguistic characteristics in their own environment and compare with some other vernaculars
nn: samanlikne språk og språkbruk i tekstar på nynorsk og bokmål

source: Thus, they are not part of the social structures of cooperation.
nn: Dei blir dermed ikkje ein del av dei sosiale samarbeidsstrukturane.

source: find and use information about social sciences when searching through digital sources, evaluate one’s findings and comply with the rules for netiquette
nn: finne og trekkje ut samfunnsfagleg informasjon ved søk i digitale kjelder, vurdere funna og følgje reglar for nettvett og nettetikk

source: Geography also focuses on explaining similarities and differences between town and country, between nations and between regions.
nn: Geografi handlar òg om å gjere greie for og forklare likskapar og skilnader mellom land og by, mellom nasjonar og mellom regionar.

source: The main area food and culture refers to the importance of food and meal customs, whether referring to everyday meals, holidays and parties, and knowledge about traditional Norwegian food and food in different cultures and religions.
nn: er måltidsskikkar til kvardag, høgtid og fest og kunnskap om norsk tradisjonsmat og mat i ulike kulturar og religionar sentrale emne.

source: novels, short stories, plays, poetry and factual prose in "bokmål" and "nynorsk" from 1850 to the present and
nn: romanar, noveller, drama, lyrikk og sakprosa på bokmål og nynorsk frå 1850 til i dag og

source: prepare Sami food and explain some features of Sami food culture
nn: lage samisk mat og gjere greie for nokre trekk ved samisk matkultur

source: Formative assessment shall help to promote learning and develop competence in the geography subject.
nn: Undervegsvurderinga skal bidra til å fremje læring og til å utvikle kompetanse i faget.

source: define the concept of culture and provide examples showing that culture varies from one place to the next and changes over time
nn: definere omgrepet kultur og gje døme på at kultur varierer frå stad til stad og endrar seg over tid

source: explain why gender roles vary from one community to the next and discuss why gender roles change over time
nn: forklare kvifor kjønnsroller varierer mellom samfunn og kulturar og diskutere kvifor kjønnsrollene endrar seg over tid

source: explain how production and consumption can destroy ecosystems and pollute the soil, water and air, and discuss and elaborate on how this might be prevented and repaired
nn: forklare korleis produksjon og forbruk kan øydeleggje økosystem og forureine jord, vatn og luft, og drøfte korleis dette kan hindrast og reparerast

source: ‘The study was carried out in 2009/2010, and it is natural to believe that both the technology and the ethical challenges have become more pressing since then’, says Sando.
nn: Studien vart gjord i 2009/2010, og det er naturleg å tru at både teknologien og dei etiske utfordringane har blitt meir påtrengjande sidan den gongen, meiner Sando.

source: carry out a major field study and use scientific methods to gather, chart and research different types of organisms, as well as present the results from the study
nn: gjennomføre eit større feltarbeid og nytte biologiske metodar til å samle inn, kartleggje og utforske ulike typar organismar og leggje fram resultata fråundersøkingane

source: In upper secondary education the social studies subject has competence aims after Vg1 in programme areas for science and languages, social sciences and economics studies in programmes for specialisation in general studies.
nn: I vidaregåande opplæring har samfunnsfag kompetansemål etter Vg1 i programområda for realfag og språk, samfunnsfag og økonomi i studiespesialiserande utdanningsprogram.

source: discuss from an international perspective the role of the media in the development of democracy
nn: diskutere media si rolle i utviklinga av demokrati i eit internasjonalt perspektiv

source: They develop when they struggle with theoretical
nn: Dei blir danna når dei bryner seg på teoretiske utfordringar

source: revolutions from the Age of Enlightenment to the present day and assess their significance for the development of modern democracy
nn: omveltingar frå opplysningstida til i dag, og vurdere kva dei har betydd for utviklinga av det moderne demokratiet

source: create, solve and explain equation sets relating to practical situations calculate the difference quotient for a linear function, and use it to
nn: lage, løyse og forklare likningssett knytte til praktiske situasjonar rekne ut stigingstalet til ein lineær funksjon og bruke det til å forklare

source: in Biology involves accounting for one’s own observations and indications from nature and the laboratory by applying subject-specific concepts.
nn: i biologi inneber å gjere greie for eigne observasjonar og røynsler frå naturen og laboratoriet ved å bruke biologifaglege omgrep.

source: the topics must help the pupils to achieve understanding and to see connections across
nn: temaa skal bidra til at elevane oppnår forståing og ser samanhengar på tvers av fag.

source: develop and use different strategies for calculations with positive
nn: utvikle og bruke ulike strategiar for rekning med positive tal og brøk og

source: how technology has been and continues to be a factor for change, and
nn: korleis teknologi har vore og framleis er ein endringsfaktor, og

source: They also demonstrate and develop competence in mathematics when reasoning about and arguing for procedures and solutions.
nn: Vidare viser og utviklar dei kompetanse i matematikk når dei resonnerer over og argumenterer for framgangsmåtar og løysingar.

source: ‘Mmm’, replies Sally in the affirmative, handing her drawing to Gloria.
nn: «Mmm,» svarer Sally stadfestande og gir Gloria teikninga si.

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics and solve mathematical problems by being creative, reasoning and reflecting.
nn: Læraren skal leggje til rette for elevmedverknad og stimulere til lærelyst ved at elevane får utforske matematikk og løyse matematiske problem gjennom å velje strategiar, vere kreative, resonnere og reflektere.

source: prepare and discuss his/her own oral or written texts inspired by literature and art
nn: gjere greie for og praktisere førebygging av og førstehjelp ved idrettsskadar

source: The pupils demonstrate and develop competence in the subject in year 7 when they explore and reflect on mathematical relationships, use mathematical terminology in communication and use different representations and problem solving strategies.
nn: Elevane viser og utviklar kompetanse i faget på 7. trinn når dei utforskar og reflekterer over matematiske samanhengar, nyttar matematiske omgrep i kommunikasjonen og bruker ulike representasjonar og problemløysingsstrategiar.

source: The pupils demonstrate and develop competence in the subject in year 9 when they reason about and discuss geometrical properties and relationships.
nn: Elevane viser og utviklar kompetanse i faget på 9. trinn når dei resonnerer over og diskuterer geometriske eigenskapar og samanhengar.

source: In this programme subject it is important to find, receive, handle, integrate and evaluate information as a basis for further work with personal forms of expression in the mediums of text, sound and images and in combinations thereof.
nn: I dette programfaget er det viktig å kunne finne, ta imot, handtere, integrere og evaluere informasjon som basis for vidare arbeid med eigne uttrykksformer i tekst-, lyd- og bildemedium og kombinasjonar av desse.

source: indicate oceans and regions of the world and use main geographical terms
nn: peike ut verdshav og verdsdelar og bruke sentrale geografiske omgrep

source: use programming to explore data in tables and datasets
nn: bruke programmering til å utforske data i tabellar og datasett

source: WHAT ARE PROPER PARENTS?
nn: Kva er «rette» foreldre?

source: Contact your kindergarten for more information.
nn: Ta kontakt med barnehagen din for meir informasjon.

source: describe, explain and present structures and developments in
nn: beskrive, forklare og presentere strukturar og utviklingar i geometriske

source: explain how opinions aobut love and sexuality can vary in and among cultures
nn: gje døme på korleis oppfatningar om forholdet mellom kjærleik og seksualitet kan variere i og mellom kulturar

source: give examples of and comment on how society, values and ways of thinking are portrayed in texts translated from Sami and other languages
nn: gje døme på og kommentere korleis samfunnsforhold, verdiar og tenkjemåtar er framstilte i omsette tekstar frå samisk og andre språk

source: Geography and history are continued as common core subjects in the programmes for general studies.
nn: Geografi og historie blir førte vidare som fellesfag i dei studieførebuande utdanningsprogramma.

source: It shall help pupils understand the ideas of an ideal body and healthy physical activity, which can influence their sense of self and ideas about health, nutrition, training and lifestyle.
nn: Det skal ruste elevane til vurdering av kroppsideal og rørslekulturar som kan påverke sjølvkjensla, helse, ernæring, trening og livsstil.

source: which promote motivation and improve insight.
nn: som fremjar motivasjon og innsikt.

source: recognise and use linguistic devices such as repetition, contrast and simple figurative language
nn: kjenne att og bruke språklege verkemiddel som oppatt-taking, kontrast og enkle språklege bilete

source: listen out for, recount, explain and reflect on the content of spoken texts
nn: lytte etter, gje att, forklare og reflektere over innhaldet i munnlege tekstar

source: describe theme and composition in texts and visual expressions
nn: skape dansekomposisjonar og vere med i dans som andre har laga

source: The school shall treat pupils with trust and respect and also place demands on them and
nn: Skolen skal møte elevane med tillit, respekt og krav, og dei skal få utfordringar som fremjar

source: Combinatorics involves systematic ways of determining numbers, and is often required for calculating probability.
nn: I kombinatorikk arbeider ein med systematiske måtar å finne tal på, og det er ofte nødvendig for å kunne berekne sannsyn.

source: read subject-related literature,
nn: orientere seg i faglitteratur,

source: It is also important to find information, to analyse, process and present data with appropriate aids, as well as to be critical about sources, analyses and results.
nn: I tillegg er det viktig å finne informasjon, analysere, behandle og presentere data med høvelege hjelpemiddel, og vere kritisk til kjelder, analysar og resultat.

source: give an account of employee and employer organizations and their place in working life and explain the factors that influence wages and working conditions
nn: gjere greie for arbeidstakar- og arbeidsgjevarorganisasjonane og deira plass i arbeidslivet og for faktorar som bestemmer lønns- og arbeidsvilkår
